# NewPointOnEdgeEdgeIntersection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewPointOnEdgeEdgeIntersection Method
Application Class See Also
---
Construct a PointOnEdgeEdgeIntersection object which is used to define the placement of a ReferencePoint given two references to edge.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PointOnEdgeEdgeIntersection NewPointOnEdgeEdgeIntersection(
	Reference edgeReference1,
	Reference edgeReference2
)
```

Visual Basic
---
```text
Public Function NewPointOnEdgeEdgeIntersection ( _
	edgeReference1 As Reference, _
	edgeReference2 As Reference _
) As PointOnEdgeEdgeIntersection
```

Visual C++
---
```text
public:
PointOnEdgeEdgeIntersection^ NewPointOnEdgeEdgeIntersection(
	Reference^ edgeReference1,
	Reference^ edgeReference2
)
```

# ### Parameters
edgeReference1
    Type: Autodesk.Revit.DB..::..ReferenceThe first edge reference.
edgeReference2
    Type: Autodesk.Revit.DB..::..ReferenceThe second edge reference.
# ### Return Value
A new PointOnEdgeEdgeIntersection object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument edgeReference1 or edgeReference2 is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Application Class
Autodesk.Revit.Creation Namespace